## Plan Result (prod_shutter_static_webapp)




<pre><code>Plan: 15 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;jd-bureau&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;jd-reply-jury-summons&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;portal&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;jd-bureau&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;jd-reply-jury-summons&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;portal&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;jd-bureau&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;jd-reply-jury-summons&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;portal&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;jd-bureau&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;jd-reply-jury-summons&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;portal&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;jd-bureau&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;jd-reply-jury-summons&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;portal&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["jd-bureau"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "juror-bureau.justice.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["jd-reply-jury-summons"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "reply-jury-summons.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["portal"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "portal-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "pre-recorded-evidence.justice.gov.uk"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["jd-bureau"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth."
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "juror-bureau.justice.gov.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["jd-reply-jury-summons"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth."
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "reply-jury-summons.service.gov.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["portal"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.portal"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "pre-recorded-evidence.justice.gov.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["jd-bureau"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "jd-bureau"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["jd-reply-jury-summons"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "jd-reply-jury-summons"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["portal"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "portal"
      + resource_group_name = "sds-platform-shutter-webapp-prod-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["jd-bureau"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "juror-bureau.justice.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["jd-reply-jury-summons"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "reply-jury-summons.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["portal"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "portal.pre-recorded-evidence.justice.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["jd-bureau"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "jd_bureau_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["jd-reply-jury-summons"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "jd_reply_jury_summons_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["portal"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "portal_prod"
      + updated_at      = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":511,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_static_webapp","Vars":{}} -->